      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROJECT2.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
               SELECT PORTFOLIO-FILE ASSIGN TO "../PORTFOLIO.txt"
                    ORGANIZATION IS LINE SEQUENTIAL.
               SELECT STOCK-FILE ASSIGN TO "../STOCKS.txt"
                   ORGANIZATION IS LINE SEQUENTIAL.
               SELECT REPORT-FILE ASSIGN TO "../REPORT-P.txt"
                   ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD STOCK-FILE.
       01 RECORD-STRUCTURE.
               05 STOCK-SYMBOL PIC X(7).
               05 STOCK-NAME PIC X(25).
               05 CLOSING-PRICE PIC 9(4)V99.
       FD PORTFOLIO-FILE.
       01 INVESTMENT-RECORD.
               05 PORTFOLIO-STOCK-SYMBOL PIC X(7).
               05 SHARES PIC 9(5).
               05 AVERAGE-COST PIC 9(4)v99.
       FD REPORT-FILE.
       01 REPORT-STRUCTURE.
            05 R-STOCK-NAME PIC X(25).
            05 FILLER PIC X(7).
            05 R-SHARES PIC ZZ,ZZ9.
            05 FILLER PIC X(7).
            05 R-UNIT-COST PIC $9,999.99.
            05 FILLER PIC X(7).
            05 R-CLOSING-PRICE PIC $9,999.99.
            05 FILLER PIC X(7).
            05 R-COST-BASE PIC $99,999.99.
           05 FILLER PIC X(7).
            05 R-MARKET-VALUE PIC $99,999.99.
           05 FILLER PIC X(7).
            05 R-GAIN-LOSS PIC +$99,999.99.


       WORKING-STORAGE SECTION.

       01 STOCK-TABLE  OCCURS 20 TIMES.
           05 WS-STOCK-SYMBOL PIC X(7).
           05 WS-STOCK-NAME PIC X(25).
           05 WS-CLOSING-PRICE PIC 9(4)V99.
           
       01 INVESTMENT-REPORT-TABLE OCCURS 20 TIMES.
           05 WS-R-STOCK-NAME PIC X(25).
           05 FILLER PIC X(3).
           05 WS-R-SHARES PIC 9(5).
           05 FILLER PIC X(3).
           05 WS-R-AVERAGE-COST PIC 9(7)v99.
           05 FILLER PIC X(3).
           05 WS-R-CLOSING-PRICE PIC 9(7)V99.
           05 FILLER PIC X(3).
           05 WS-R-ADJUSTED-COST-BASE PIC 9(12)V99.
           05 FILLER PIC X(3).
           05 WS-R-MARKET-VALUE PIC 9(12)V99.
           05 FILLER PIC X(3).
           05 WS-R-GAIN-LOSS PIC 9(12)V99.
           
       01 PORTFOLIO-TABLE OCCURS 20 TIMES.
           05 WS-PSTOCK-SYMBOL PIC X(7).
           05 WS-P-SHARES PIC 9(5).
           05 WS-P-AVERAGE-COST PIC 9(7)V99.
           
       01 EDITED-AVERAGE-COST PIC $9,999.99.
       01 EDITED-CLOSING-PRICE PIC $9,999.99.
       01 EDITED-COST-BASE PIC $99,999.99.
       01 EDITED-MARKET-VALUE PIC $99,999.99.
       01 EDITED-GAIN-LOSS PIC +$99,999.99.
       
       01 STOCK-INDEX PIC 99.
       01 PORTFOLIO-INDEX PIC 99.
       01 MY-FIELDS.
               05 EOF-STOCK-FLAG PIC A VALUE "N".
               05 EOF-PORTFOLIO-FLAG PIC A VALUE "N".
               05 STOCK-SEARCH-FLAG PIC A VALUE "N".
               05 EOF-READ-FLAG PIC A VALUE "N".
               05 RECORD-WRITTEN PIC 99 VALUE 0.
               05 RECORDS-READ PIC 99 VALUE 0.

       01 DASH-LINE PIC X(120) VALUE ALL "=".
       01 HEADER-LINE.
            05 H-STOCK-NAME PIC X(25) VALUE "STOCK NAME".
            05 FILLER PIC X(3).
            05 H-SHARES PIC X(7)  VALUE "#SHARES".
            05 FILLER PIC X(3).
            05 H-UNIT-COST PIC X(10) VALUE "UNIT COST".
            05 FILLER PIC X(3).
            05 H-CLOSING PIC X(10) VALUE "AT CLOSING".
            05 FILLER PIC X(3).
            05 H-COST-BASE PIC X(15) VALUE "COST BASE".
            05 FILLER PIC X(3).
            05 H-MARKET-VALUE PIC X(15) VALUE "MARKET VALUE".
            05 FILLER PIC X(3).
            05 H-GAIN-LOSS PIC X(14) VALUE "GAIN/LOSS".


       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           PERFORM 201-INITIALIZATION.
           PERFORM 202-WRITE-ONE-REPORT.
           PERFORM 203-TERMINATE.
           STOP RUN.

       201-INITIALIZATION.
           PERFORM 301-OPEN-FILES.
           PERFORM 302-READ-LOAD-STOCK-TABLE
           PERFORM 303-READ-LOAD-PORTFOLIO-TABLE
           PERFORM 304-WRITE-HEADER-BANNER.
           PERFORM 306-READ-RECORD.

       301-OPEN-FILES.
           OPEN INPUT PORTFOLIO-FILE.
           OPEN INPUT STOCK-FILE.
           OPEN OUTPUT REPORT-FILE.
           
       302-READ-LOAD-STOCK-TABLE.
           PERFORM VARYING STOCK-INDEX FROM 1 BY 1 
           UNTIL STOCK-INDEX > 20 OR EOF-STOCK-FLAG = "Y"
           READ STOCK-FILE
               AT END MOVE "Y" TO EOF-STOCK-FLAG
               NOT AT END
                MOVE STOCK-SYMBOL TO WS-STOCK-SYMBOL(STOCK-INDEX)
                MOVE STOCK-NAME TO WS-STOCK-NAME(STOCK-INDEX)
                MOVE CLOSING-PRICE TO WS-CLOSING-PRICE(STOCK-INDEX)
           END-PERFORM.
               
       303-READ-LOAD-PORTFOLIO-TABLE.
           PERFORM VARYING PORTFOLIO-INDEX FROM 1 BY 1 
           UNTIL PORTFOLIO-INDEX > 20 OR EOF-PORTFOLIO-FLAG = "Y"
           READ PORTFOLIO-FILE
               AT END MOVE "Y" TO EOF-PORTFOLIO-FLAG
               NOT AT END
                   MOVE PORTFOLIO-STOCK-SYMBOL TO
                       WS-PSTOCK-SYMBOL(PORTFOLIO-INDEX)
                   MOVE SHARES TO WS-P-SHARES(PORTFOLIO-INDEX)
                   MOVE AVERAGE-COST TO WS-P-AVERAGE-COST
                   (PORTFOLIO-INDEX)
                   ADD 1 TO RECORDS-READ
           END-PERFORM.
               
       304-WRITE-HEADER-BANNER.
             MOVE DASH-LINE TO REPORT-STRUCTURE.
             WRITE REPORT-STRUCTURE.
             MOVE HEADER-LINE TO REPORT-STRUCTURE.
             WRITE REPORT-STRUCTURE.
             MOVE DASH-LINE TO REPORT-STRUCTURE.
             WRITE REPORT-STRUCTURE.

       306-READ-RECORD.
               READ PORTFOLIO-FILE
               AT END
               MOVE "Y" TO EOF-PORTFOLIO-FLAG
               NOT AT END
               ADD 1 TO RECORDS-READ
               MOVE INVESTMENT-RECORD TO
               PORTFOLIO-TABLE(PORTFOLIO-INDEX).
               MOVE PORTFOLIO-STOCK-SYMBOL TO
               WS-PSTOCK-SYMBOL(PORTFOLIO-INDEX).
               MOVE SHARES TO WS-P-SHARES(PORTFOLIO-INDEX).
               MOVE AVERAGE-COST TO WS-P-AVERAGE-COST(PORTFOLIO-INDEX).


       202-WRITE-ONE-REPORT.
           MOVE "N" TO STOCK-SEARCH-FLAG.
            MOVE WS-PSTOCK-SYMBOL(PORTFOLIO-INDEX) TO
            PORTFOLIO-STOCK-SYMBOL.
            MOVE WS-P-SHARES(PORTFOLIO-INDEX) TO SHARES.
            MOVE WS-P-AVERAGE-COST(PORTFOLIO-INDEX) TO AVERAGE-COST.

           PERFORM 307-SEARCH-STOCK-FILE VARYING STOCK-INDEX FROM
           1 BY 1 UNTIL STOCK-INDEX > 20 OR STOCK-SEARCH-FLAG = "Y".
           IF STOCK-SEARCH-FLAG = "Y"
           PERFORM 308-CALCULATE-PORTFOLIO-VALUE
           PERFORM 309-WRITE-REPORT-RECORD
           END-IF.

       307-SEARCH-STOCK-FILE.
           IF WS-STOCK-SYMBOL(STOCK-INDEX) = PORTFOLIO-STOCK-SYMBOL

                     MOVE WS-STOCK-NAME(STOCK-INDEX) TO
                     WS-R-STOCK-NAME(PORTFOLIO-INDEX)
                     MOVE SHARES TO WS-R-SHARES(PORTFOLIO-INDEX)
                     MOVE AVERAGE-COST TO
                     WS-R-AVERAGE-COST(PORTFOLIO-INDEX)
                     MOVE WS-CLOSING-PRICE(STOCK-INDEX) TO
                     WS-R-CLOSING-PRICE(PORTFOLIO-INDEX)
                     MOVE "Y" TO STOCK-SEARCH-FLAG
                 END-IF.

       308-CALCULATE-PORTFOLIO-VALUE.
               COMPUTE WS-R-ADJUSTED-COST-BASE (PORTFOLIO-INDEX) =
               WS-R-SHARES(PORTFOLIO-INDEX) *
               WS-R-AVERAGE-COST(PORTFOLIO-INDEX).
               COMPUTE WS-R-MARKET-VALUE (PORTFOLIO-INDEX) =
               WS-R-SHARES(PORTFOLIO-INDEX) *
               WS-R-CLOSING-PRICE(PORTFOLIO-INDEX).
               COMPUTE WS-R-GAIN-LOSS(PORTFOLIO-INDEX) =
               WS-R-MARKET-VALUE(PORTFOLIO-INDEX) -
               WS-R-ADJUSTED-COST-BASE(PORTFOLIO-INDEX).

       309-WRITE-REPORT-RECORD.
             MOVE SPACES TO REPORT-STRUCTURE.
             MOVE WS-R-STOCK-NAME(PORTFOLIO-INDEX) TO R-STOCK-NAME.
             MOVE WS-R-SHARES(PORTFOLIO-INDEX) TO R-SHARES.
             MOVE WS-R-AVERAGE-COST(PORTFOLIO-INDEX) TO
             EDITED-AVERAGE-COST.
             MOVE EDITED-AVERAGE-COST TO R-UNIT-COST.
             MOVE WS-R-CLOSING-PRICE(PORTFOLIO-INDEX) TO
             EDITED-CLOSING-PRICE.
             MOVE EDITED-CLOSING-PRICE TO R-CLOSING-PRICE.
             COMPUTE WS-R-ADJUSTED-COST-BASE(PORTFOLIO-INDEX) =
             WS-R-SHARES(PORTFOLIO-INDEX) *
             WS-R-AVERAGE-COST(PORTFOLIO-INDEX).
             MOVE WS-R-ADJUSTED-COST-BASE(PORTFOLIO-INDEX) TO
             EDITED-COST-BASE.
             MOVE EDITED-COST-BASE TO R-COST-BASE.
             COMPUTE WS-R-MARKET-VALUE(PORTFOLIO-INDEX) =
             WS-R-SHARES(PORTFOLIO-INDEX) *
             WS-R-CLOSING-PRICE(PORTFOLIO-INDEX).
             MOVE WS-R-MARKET-VALUE(PORTFOLIO-INDEX) TO
             EDITED-MARKET-VALUE.
             MOVE EDITED-MARKET-VALUE TO R-MARKET-VALUE.
             COMPUTE WS-R-GAIN-LOSS(PORTFOLIO-INDEX) =
             WS-R-MARKET-VALUE(PORTFOLIO-INDEX) -
             WS-R-ADJUSTED-COST-BASE(PORTFOLIO-INDEX).
             MOVE WS-R-GAIN-LOSS(PORTFOLIO-INDEX) TO EDITED-GAIN-LOSS.
             MOVE EDITED-GAIN-LOSS TO R-GAIN-LOSS.

            WRITE REPORT-STRUCTURE.
            ADD 1 TO RECORD-WRITTEN.

       203-TERMINATE.

            PERFORM 310-WRITE-FOOTER-BANNER.
            PERFORM 311-DISPLAY-AUDIT-INFO.
            PERFORM 312-CLOSE-INPUT-FILES.
            PERFORM 313-CLOSE-OUTPUT-FILE.

       310-WRITE-FOOTER-BANNER.

           MOVE DASH-LINE TO REPORT-STRUCTURE.
           WRITE REPORT-STRUCTURE.

       311-DISPLAY-AUDIT-INFO.
           DISPLAY DASH-LINE.
           DISPLAY HEADER-LINE.
           DISPLAY DASH-LINE.
           DISPLAY INVESTMENT-REPORT-TABLE(PORTFOLIO-INDEX).
           DISPLAY "RECORDS READ: " RECORDS-READ " RECORDS WRITTEN: "
           RECORD-WRITTEN.

       312-CLOSE-INPUT-FILES.
           CLOSE STOCK-FILE.
           CLOSE PORTFOLIO-FILE.

       313-CLOSE-OUTPUT-FILE.
           CLOSE REPORT-FILE.

       END PROGRAM PROJECT2.
